app/controllers/me_controller.rb

  def update_user_image
    begin
      if request.body
        user_image_name = requested_user.user_name + "_#{requested_user.id}" + "." + request.content_mime_type.symbol.to_s
        serverpath = "#{Rails.root}/Data/user_image/#{user_image_name}"
        File.open(serverpath,"wb") do |file|
          file.write request.body.read
        end
      requested_user.update_attributes!(:image => serverpath,
                                        :image_content_type => request.content_type,
                                        :image_name => user_image_name,
                                        :image_url => SERVER_DOMAIN_NAME + "crowdclub/api/get/user_image/" + user_image_name
                                        )
---
UPDATE `users` SET `image` = '--- /home/kannan/Documents/planetapps/CrowdClub/Data/user_image/kannanre_1.jpeg\n', `image_name` = '--- kannanre_1.jpeg\n', `preferences` = '--- \n', `updated_at` = '2012-05-21 07:40:44', `image_content_type` = '--- image/jpeg\n', `image_url` = 'http://localhost:3000/crowdclub/api/get/user_image/kannanre_1.jpeg' WHERE `users`.`id` = 1